Repository: giellalt/corpus-fin
Catalog: prestable/tmx/fin2sme/admin/sd/www.samediggi.fi/index2.php_option=com_content_task=view_id=261_lang=finnish.html.tmx
Source language: fin
Languages: sme

source: Minä olen Anni Koivisto, utsjokinen, melkein 17-vuotias saamelaisnuori (2008)
sme: Mun lean Anni Koivisto, ohcejohkalaš, farga 17-jahkásaš sámenuorra

source: Alun perin olen kotoisin Kaamasesta, mutta niiltä ajoilta en muista oikeastaan mitään, kun olin niin pieni vielä silloin.
sme: Álggoálggus lean eret Gápmasis, muhto dieid áiggiin in muitte iešalddes maidige, go ledjen nu uhcci vel dalle.

source: Opiskelen ahkerasti toista vuotta Utsjoen saamelaislukiossa.
sme: Stuđeren viššalit nuppi jagi Ohcejoga sámelogahagas.

source: Äidinkieleni on saame, suomea opin sitten katsomalla televisiosta Muumeja.
sme: Mu eatnigiella lea sámegiella, suomagiela ohppen go gehččen televišuvnnas Mumeniid.

source: Yritän kovasti ehtiä harrastamaan kaikenlaista, tai siis, lähinnä niitä juttuja, mitä Utsjoella on tarjolla.
sme: Geahččalan geargat dahkat buotlágan somás hommáid, dahje lagamustá dakkár áššiid, mat Ohcejogas leat fállun.

source: Tykkään mm. kirjoitella kaikennäköisiä tekstejä ja kutoa.
sme: Liikon ee. čálašit buotlágan teavsttaid ja gođđit.

source: Saamelaisuus näkyy elämässäni lähinnä saamen kielellä käydyissä keskusteluissa ja juhlapukeutumisessa.
sme: Sápmelašvuohta oidno eallimisttán lagamustá nu ahte geavahan sámegiela ságastallamiin ja čiŋadan sámebiktasiidda.

source: Ei se muuten kai näykään.
sme: Ii dat muđui várra oidnoge.

source: Tietysti se merkitsee minulle enemmänkin kuin vain kieltä ja vaatteita.
sme: Dieđusge dat mearkkaša munnje eanetge go dušše giela ja biktasiid.

source: On minulle toki tärkeää myös saamelaisuus itsessään.
sme: Lea munnje áinnas dehálaš maid ieš sápmelašvuohta.

source: Se on sellainen oikeus ja velvoite.
sme: Dat lea dakkár vuoigatvuohta ja geatnegasvuohta.

source: On toisinaan ahdistavaa, kun tietää että ihmiset odottavat minun jäävän Utsjoelle puhumaan saamea, menevän naimisiin jonkun ihastuttavan saamelaismiehen kanssa ja synnyttävän saamelaisia lapsia.
sme: Orru muhtumin áŧestuhtti, go diehtá ahte olbmot vurdet mu báhcit Ohcejohkii hállat sámegiela, náitalit geainnanu somás sámealbmáin ja riegádahttit sámemánáid.

source: Sitten jos en teekään niin, olen jotenkin huono ihminen.
sme: Dasto jos in dagage nu, lean monu fuones olmmoš.

source: Enhän minä itse edes tiedä, mitä elämältä haluan.
sme: Inhan mun ieš oppa dieđe, maid eallimis hálidan.

source: Ehkä minä toteutan kylän toiveen.
sme: Kánske mun ollašuhtán gili sávaldaga.

source: Voisinhan minä itseni tänne kuvitella.
sme: Sáhtášinhan mun iežan deike govahallat
